# Є набір чисел (float або int). Вам потрібно знайти різницю між найбільшим (максимум) і найменшим (мінімум) елементом. Ваша функція difference має вміти працювати з невизначеною кількістю аргументів. Якщо аргументів немає, то функція повертає 0 (нуль).
#
# Якщо з 3-м тестом будуть проблеми, використовуйте функцію округлення round(x, 2), де х це число, яке потрібно округлити.
#
# Вх. Дані: Змінна кількість аргументів як числа (int, float).
#
# Вих. Дані: Різниця між максимумом і мінімумом як число (int, float).

def difference(*args):
    if not args:
        return 0
    return round(max(args) - min(args), 2)

print(difference(10.2, -2.2, 0, 1.1, 0.5))
print(difference(5, -5))
print(difference(1, 2, 3))
print(difference())