# На запит від програми, користувач вводить 5-ти значне ціле, позитивне число. Вам необхідно "перевернути" цє число задом наперед, тобто щоб у результаті вийшло теж 5-ти значне число, але із зворотною послідовністю цифр.
#
# Вам не потрібно перевіряти, що користувач ввів правильне число - зробіть вигляд, що користувач завжди вводить 5 значне число. Тобто введене користувачем число завжди складатиметься з 5 цифр.
#
# Якщо користувач ввів інше число, це проблема користувача, а не вашої програми.
#
# Використовуються лише цілі числа.
#
# Для розв'язання задачі потрібно використовувати лише той зріз даних, який було пройдено. Тобто використовувати строки не можна.
#
# Приклади:
#
# Користувач ввів: 12345 - на екрані відображається: 54321
#
# Користувач ввів: 37568 - на екран відображається: 86573

print("input 5 numbers")
user_input = input()
numbers = int (user_input)

number1 = numbers % 10
number2 = numbers // 10 % 10
number3 = numbers // 100 % 10
number4 = numbers // 1000 % 10
number5 = numbers // 10000

print(number1,end="")
print(number2,end="")
print(number3,end="")
print(number4,end="")
print(number5)

