# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
#
# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
#
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
#
# Ну і додатковим завданням є турбота про виведення.
#
# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
#
# Підказка: одна хвилина - 60 сек., В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек. Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
#
# Доповнити провідними нулями можна за допомогою методу zfill(2)

user_input = int(input("Enter a number between 0 and 8640000: "))

if user_input < 0 or user_input > 8640000:
    print("Error")

convertor = {"seconds": user_input % 60, "minutes": (user_input // 60) % 60, "hours": (user_input // 3600) % 24,
             "days": user_input // 86400}

days = convertor["days"]

if days % 10 == 1 and days % 100 != 11:
    print(f"{days} день, {convertor["hours"]:02d}:{convertor["minutes"]:02d}:{convertor["seconds"]:02d}")
elif 2 <= days % 10 <= 4 and (days % 100 < 10 or days % 100 >= 20):
    print(f"{days} дні, {convertor["hours"]:02d}:{convertor["minutes"]:02d}:{convertor["seconds"]:02d}")
else:
    print(f"{days} днів, {convertor["hours"]:02d}:{convertor["minutes"]:02d}:{convertor["seconds"]:02d}")