# Напишіть функцію common_elements, яка згенерує два списки елементів з генераторного виразу (range) для 100 елементів, за наступними правилом:
#
# Один список з числами кратними 3, інший з кратними числами 5.
#
# За допомогою множин створіть набір з числами, які є в обох множинах (перетин).
#
# Функція повинна повернути цю множину як результат своєї роботи.

def common_elements():
    with3 = {x for x in range(100) if x % 3 == 0}
    with5 = {x for x in range(100) if x % 5 == 0}
    both = with3 & with5
    print(with3)
    print(with5)
    return both


print(common_elements())
