# На вхід функції popular_words передаються два аргументи. Текст та список слів, популярність яких необхідно визначити.
#
# При вирішенні цього завдання зверніть увагу на такі моменти
#
# Слова необхідно шукати у всіх регістрах. Тобто. якщо необхідно знайти слово "one", значить для нього будуть підходити слова "one", "One", "oNe", "ONE" і т.д.
# Шукані слова завжди вказані в нижньому регістрі
# Якщо слово не знайдено жодного разу, його необхідно повернути у словнику зі значенням 0 (нуль)
# Вхідні параметри: Текст і масив слів, що шукаються.
#
# Вихідні параметри: Словник, у якому ключами є шукані слова та значеннями, скільки разів кожнє слово зустрічаються у орігінальному тексті.

def popular_words (text, words):
    text = text.lower().split()
    return {word: text.count(word) for word in words}


print(popular_words('''When I was One I had just begun When I was Two i was nearly new one OnE ONE oNe''', ['i', 'was', 'three', 'near','one']))